perf/logs.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp
      duration: 30
      arrivalRate: 1
      rampTo: 5
    - name: Plain
      duration: 60
      arrivalRate: 5
    - name: Ramp
      duration: 30
      arrivalRate: 5
      rampTo: 10
    - name: Plain
      duration: 60
      arrivalRate: 10
    #- name: Ramp
    #  duration: 30
    #  arrivalRate: 50
    #  rampTo: 100
    #- name: Plain
    #  duration: 60
    #  arrivalRate: 100
    

scenarios:
  - name: GET_Logs
    flow:
      - get:
          url: '/log'