perf/rates.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"
  payload:
    # path is relative to the location of the test script
    path: 'rates.csv'
    fields:
      - 'baseCurrency'
      - 'counterCurrency'
      - 'rate'

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  # General Phases for all scenarios
  phases:
    - name: Ramp to 5 in 30s
      duration: 30
      arrivalRate: 1
      rampTo: 5
    - name: Plain in 5 by 60s
      duration: 60
      arrivalRate: 5
    - name: Ramp to 10 in 30s
      duration: 30
      arrivalRate: 5
      rampTo: 10
    - name: Plain in 10 by 60s
      duration: 60
      arrivalRate: 10    

# Scenarios
scenarios:
  # Scenario for Get Rates
  - name: Get
    flow:
      - get:
          url: '/rates'

  # Scenario for Put Rates
  - name: Put
    flow:
      - put:
          url: '/rates'
          json: 
            baseCurrency: '{{ baseCurrency }}'
            counterCurrency: '{{ counterCurrency }}'
            rate: '{{ rate }}'


    # Specific phases for this scenario
    phases:
      - name: Ramp to 50 in 30s
        duration: 30
        arrivalRate: 10
        rampTo: 50
      - name: Plain in 50 by 60s
        duration: 60
        arrivalRate: 50
      - name: Ramp to 100 in 30s
        duration: 30
        arrivalRate: 50
        rampTo: 100
      - name: Plain in 100 by 60s
        duration: 60
        arrivalRate: 100